# LiquidViscosity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..LiquidViscosity Property
ThermalAsset Class See Also
---
The liquid viscosity of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double LiquidViscosity { get; set; }
```

Visual Basic
---
```text
Public Property LiquidViscosity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double LiquidViscosity {
	double get ();
	void set (double value);
}
```

# Remarks
Values are in kilograms per feet-second (kg/(ft · s)) and must be non-negative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for liquidViscosity must be non-negative. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the asset must be liquid to set this property. |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace